# Seth Elias
## Week 12 - 11/07/24
### Python Pandas series and dataframes

- pandas is a library used for working with data sets
- used for analyzing, cleaning, exploring, and manipulating data
- fast and efficient datafram object
-

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
print(pd.__version__)

1.0.5

In [3]:
s = pd.Series(np.arange(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [4]:
type(s)

pandas.core.series.Series

In [5]:
s.values

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [6]:
s.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
# create labels
s = Series(np.arange(1,5), index = ['w', 'x', 'y', 'z'])
s

w    1
x    2
y    3
z    4
dtype: int32

In [8]:
s['x']

2

In [9]:
x[1]

NameError: name 'x' is not defined

In [10]:
s['x'] + s['w']

3

In [11]:
data = np.array(['a', 'b', 'c', 'd'])
s = Series(data, index = [100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

In [12]:
summer_olympics = Series([2520, 1122, 937, 847, 713], index = ['USA', 'Germany', 'Russia', 'UK', 'France'])
summer_olympics

USA        2520
Germany    1122
Russia      937
UK          847
France      713
dtype: int64

In [13]:
summer_olympics['USA']

2520

In [14]:
summer_olympics[summer_olympics > 800]

USA        2520
Germany    1122
Russia      937
UK          847
dtype: int64

In [15]:
summer_olympics > 800

USA         True
Germany     True
Russia      True
UK          True
France     False
dtype: bool

In [16]:
'USA' in summer_olympics

True

In [17]:
d = summer_olympics.to_dict()
d

{'USA': 2520, 'Germany': 1122, 'Russia': 937, 'UK': 847, 'France': 713}

In [18]:
s = Series(d)
s

USA        2520
Germany    1122
Russia      937
UK          847
France      713
dtype: int64

In [19]:
countries = ['Russia', 'France', 'Spain', 'Germany', 'USA', 'UK', 'Italy']
s = Series(d, index = countries)
s

Russia      937.0
France      713.0
Spain         NaN
Germany    1122.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [20]:
pd.isnull(s)

Russia     False
France     False
Spain       True
Germany    False
USA        False
UK         False
Italy       True
dtype: bool

In [21]:
pd.notnull(s)

Russia      True
France      True
Spain      False
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [22]:
summer_olympics + s

France     1426.0
Germany    2244.0
Italy         NaN
Russia     1874.0
Spain         NaN
UK         1694.0
USA        5040.0
dtype: float64

In [23]:
s

Russia      937.0
France      713.0
Spain         NaN
Germany    1122.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [24]:
s.name = "Summer Olympics"

In [25]:
s

Russia      937.0
France      713.0
Spain         NaN
Germany    1122.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympics, dtype: float64

In [26]:
s.index.name = 'Country'

In [27]:
s

Country
Russia      937.0
France      713.0
Spain         NaN
Germany    1122.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympics, dtype: float64

In [29]:
# dataframe
# dataframe is a 2 dimensional data structure, like 2 dimensional array
data = {
    'calories' : [420, 380, 390],
    'fruits' : ['Orange', 'Banana', 'Grape']
}
data

{'calories': [420, 380, 390], 'fruits': ['Orange', 'Banana', 'Grape']}

In [30]:
# load data into dataframe
df = DataFrame(data)
df

   calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   calories  3 non-null      int64
 1   fruits    3 non-null      object
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [32]:
df.describe

<bound method NDFrame.describe of    calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape>

In [33]:
df['calories']

0    420
1    380
2    390
Name: calories, dtype: int64

In [34]:
type(df['calories'])

pandas.core.series.Series

In [35]:
df['fruits']

0    Orange
1    Banana
2     Grape
Name: fruits, dtype: object

In [36]:
df.loc[0]

calories       420
fruits      Orange
Name: 0, dtype: object

In [38]:
df.loc[[0,2]]

   calories  fruits
0       420  Orange
2       390   Grape

In [39]:
df[['fruits', 'calories']]

   fruits  calories
0  Orange       420
1  Banana       380
2   Grape       390

In [40]:
d = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
d

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [41]:
df = DataFrame(d)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
df.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [43]:
df.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [44]:
#reorder the columns
df = DataFrame(df, columns=['year', 'state', 'pop'])
df

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [46]:
df = DataFrame(d, columns=['year', 'state', 'pop', 'debt'], index = ['one', 'two', 'three', 'four', 'five', 'six'])
df

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [47]:
df.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [48]:
df.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [49]:
df['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [50]:
df.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [51]:
df.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [52]:
df.loc[['three', 'five']]

       year   state  pop debt
three  2002    Ohio  3.6  NaN
five   2002  Nevada  2.9  NaN

In [53]:
len(df)

6

In [54]:
len(df['state'])

6

In [55]:
df['debt'] = len(df['state'])

In [56]:
df

       year   state  pop  debt
one    2000    Ohio  1.5     6
two    2001    Ohio  1.7     6
three  2002    Ohio  3.6     6
four   2001  Nevada  2.4     6
five   2002  Nevada  2.9     6
six    2003  Nevada  3.2     6

In [57]:
df['debt'] = np.arange(len(df['state']))

In [58]:
df

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [60]:
df['debt'] = np.random.random(6)*10
df

       year   state  pop      debt
one    2000    Ohio  1.5  7.029626
two    2001    Ohio  1.7  8.757258
three  2002    Ohio  3.6  9.427755
four   2001  Nevada  2.4  9.135816
five   2002  Nevada  2.9  2.949412
six    2003  Nevada  3.2  5.174481

In [61]:
df['debt']

one      7.029626
two      8.757258
three    9.427755
four     9.135816
five     2.949412
six      5.174481
Name: debt, dtype: float64

In [62]:
s = Series([-1.2,-1.5,-1.7], index = ['two', 'four', 'five'])
s

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [63]:
df['debt'] = s
df

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [65]:
df['eastern'] = df['state'] == 'Ohio'
df

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [66]:
# delete column
del df['eastern']
df

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN